ws-load-test.yml
config:
  target: "ws://localhost:8080/ws/chat"
  phases:
    - duration: 30  # 30초 동안 테스트 실행
      arrivalRate: 10  # 초당 10명씩 연결
  defaults:
    headers:
      Authorization: "Bearer testToken1"  # WebSocket 연결 시 인증 토큰 추가
scenarios:
  - engine: "ws"
    name: "WebSocket STOMP Load Test"
    flow:
      # 1️⃣ STOMP CONNECT 프레임 보내기
      - send:
          text: |
            CONNECT
            accept-version:1.1,1.2
            host:localhost

            \u0000
      - think: 1

      # 2️⃣ STOMP 메시지 구독 (채팅방 메시지 받기)
      - send:
          text: |
            SUBSCRIBE
            id:sub-1
            destination:/topic/chat/1
            ack:auto

            \u0000
      - think: 1

      # 3️⃣ STOMP SEND (채팅 메시지 보내기)
      - send:
          text: |
            SEND
            destination:/app/sendMessage
            content-type:application/json

            {"roomId":1,"message":"Hello from Artillery!"}

            \u0000
      - think: 2

      # 4️⃣ STOMP DISCONNECT (테스트 종료 후 연결 해제)
      - send:
          text: |
            DISCONNECT
            receipt:77

            \u0000